
# Урок 4. Условные конструкции: if, if-else, тернарная операция и условные выражения

## Теория

На этом уроке мы рассмотрим:
- Как работают операторы `if` и `if-else`.
- Использование тернарной операции.
- Условные выражения: операции сравнения и логические операции.
- Типичные ошибки и их решение.

---

### 1. Оператор `if`

Оператор `if` используется для выполнения блока кода только в случае, если указанное условие возвращает значение `true`.

#### Синтаксис:
```csharp
if (условие)
{
    // Код, который выполнится, если условие истинно
}
```

#### Пример:
```csharp
int number = 10;

if (number > 0)
{
    Console.WriteLine("Число положительное.");
}
```

---

### 2. Оператор `if-else`

Оператор `if-else` позволяет указать альтернативный блок кода, который выполнится, если условие в `if` оказалось ложным (`false`).

#### Синтаксис:
```csharp
if (условие)
{
    // Код, который выполнится, если условие истинно
}
else
{
    // Код, который выполнится, если условие ложно
}
```

#### Пример:
```csharp
int number = -5;

if (number > 0)
{
    Console.WriteLine("Число положительное.");
}
else
{
    Console.WriteLine("Число отрицательное.");
}
```

---

### 3. Тернарная операция

Тернарная операция позволяет проверить условие и выполнить одно из двух действий в зависимости от его истинности. Она компактнее, чем `if-else`, и имеет следующий синтаксис:
```csharp
[условие] ? [выражение1] : [выражение2];
```

#### Пример:
```csharp
int x = 3;
int y = 2;

int z = x < y ? (x + y) : (x - y);
Console.WriteLine(z); // Результат: 1
```

---

### 4. Условные выражения: операции сравнения

Операции сравнения возвращают значение типа `bool` (`true` или `false`) в зависимости от их истинности.

| Оператор | Описание               | Пример       | Результат |
|----------|------------------------|--------------|-----------|
| `==`     | Равенство              | `10 == 4`    | `false`   |
| `!=`     | Неравенство            | `10 != 4`    | `true`    |
| `<`      | Меньше                 | `10 < 4`     | `false`   |
| `>`      | Больше                 | `10 > 4`     | `true`    |
| `<=`     | Меньше или равно       | `10 <= 4`    | `false`   |
| `>=`     | Больше или равно       | `10 >= 4`    | `true`    |

---

### 5. Логические операции

Логические операции объединяют несколько условий или изменяют их значения.

| Оператор | Описание                | Пример                          | Результат |
|----------|-------------------------|----------------------------------|-----------|
| `\|`     | Логическое ИЛИ          | `(5 > 6) \| (4 < 6)`             | `true`    |
| `&`      | Логическое И            | `(5 > 6) & (4 < 6)`              | `false`   |
| `\|\|`    | Укороченное логическое ИЛИ | `(5 > 6) \|\| (4 < 6)`          | `true`    |
| `&&`     | Укороченное логическое И | `(5 > 6) && (4 < 6)`            | `false`   |
| `!`      | Логическое отрицание    | `!(5 > 6)`                      | `true`    |
| `^`      | Исключающее ИЛИ         | `(5 > 6) ^ (4 < 6)`             | `true`    |

---

## Полезные советы

1. Используйте `else if` для проверки нескольких условий вместо вложенных `if`.
2. Применяйте тернарную операцию для компактного кода.
3. Логические операторы `&&` и `||` позволяют остановить проверку условий, если результат уже определён.
4. Убедитесь, что каждое условие имеет логический результат.

---

## Практические задания

### Задача 1: Проверка чётности числа
Напишите программу, которая проверяет, является ли число чётным.

```csharp
using System;

class Program
{
    static void Main()
    {
        Console.WriteLine("Введите число:");
        if (int.TryParse(Console.ReadLine(), out int number))
        {
            Console.WriteLine(number % 2 == 0 ? "Число чётное." : "Число нечётное.");
        }
        else
        {
            Console.WriteLine("Введено некорректное значение.");
        }
    }
}
```

---

### Задача 2: Определение времени года
Напишите программу, которая по номеру месяца определяет время года.

```csharp
using System;

class Program
{
    static void Main()
    {
        Console.WriteLine("Введите номер месяца (от 1 до 12):");
        if (int.TryParse(Console.ReadLine(), out int month))
        {
            if (month == 12 || month == 1 || month == 2)
                Console.WriteLine("Зима");
            else if (month >= 3 && month <= 5)
                Console.WriteLine("Весна");
            else if (month >= 6 && month <= 8)
                Console.WriteLine("Лето");
            else if (month >= 9 && month <= 11)
                Console.WriteLine("Осень");
            else
                Console.WriteLine("Неверный номер месяца.");
        }
        else
        {
            Console.WriteLine("Введено некорректное значение.");
        }
    }
}
```

---

### Задача 3: Проверка диапазона
Напишите программу, которая проверяет, входит ли число в диапазон от 10 до 20 включительно.

```csharp
using System;

class Program
{
    static void Main()
    {
        Console.WriteLine("Введите число:");
        if (int.TryParse(Console.ReadLine(), out int number))
        {
            Console.WriteLine(number >= 10 && number <= 20 ? "Число входит в диапазон." : "Число не входит в диапазон.");
        }
        else
        {
            Console.WriteLine("Введено некорректное значение.");
        }
    }
}
```

---

### Задача 4: Классификация температуры
Напишите программу, которая классифицирует температуру.

```csharp
using System;

class Program
{
    static void Main()
    {
        Console.WriteLine("Введите температуру:");
        if (int.TryParse(Console.ReadLine(), out int temperature))
        {
            if (temperature < 0)
                Console.WriteLine("Холодно.");
            else if (temperature <= 20)
                Console.WriteLine("Прохладно.");
            else if (temperature <= 30)
                Console.WriteLine("Тепло.");
            else
                Console.WriteLine("Жарко.");
        }
        else
        {
            Console.WriteLine("Введено некорректное значение.");
        }
    }
}
```

---

### Задача 5: Минимальный калькулятор
Напишите программу, которая принимает два числа и оператор (`+`, `-`, `*`, `/`) и выполняет соответствующую операцию.

```csharp
using System;

class Program
{
    static void Main()
    {
        Console.WriteLine("Введите первое число:");
        if (double.TryParse(Console.ReadLine(), out double a))
        {
            Console.WriteLine("Введите второе число:");
            if (double.TryParse(Console.ReadLine(), out double b))
            {
                Console.WriteLine("Введите оператор (+, -, *, /):");
                char operation = Console.ReadLine()[0];

                if (operation == '+')
                    Console.WriteLine($"Результат: {a + b}");
                else if (operation == '-')
                    Console.WriteLine($"Результат: {a - b}");
                else if (operation == '*')
                    Console.WriteLine($"Результат: {a * b}");
                else if (operation == '/')
                {
                    if (b != 0)
                        Console.WriteLine($"Результат: {a / b}");
                    else
                        Console.WriteLine("Ошибка: деление на ноль.");
                }
                else
                    Console.WriteLine("Неверный оператор.");
            }
            else
            {
                Console.WriteLine("Второе число введено некорректно.");
            }
        }
        else
        {
            Console.WriteLine("Первое число введено некорректно.");
        }
    }
}
```


