
# Урок 2: Использование var, преобразование типов и частые ошибки

## Как создать проект в Visual Studio

Перед началом работы создадим новый проект в Visual Studio. Следуйте инструкциям из первого урока для создания консольного приложения.

## Теория

В этом уроке мы разберем ключевые концепции, связанные с типами данных в C#, такие как использование ключевого слова `var`, преобразование типов и распространенные ошибки, которые встречаются у начинающих программистов.

### 1. Ключевое слово `var`

В C# ключевое слово `var` позволяет компилятору автоматически определять тип переменной на основе значения, присваиваемого этой переменной. Например:
```csharp
var number = 10; // Тип будет определен как int
var text = "Hello"; // Тип будет определен как string
```

Важно помнить, что использование `var` оправдано только в случаях, когда тип очевиден из контекста, или для удобства в более сложных ситуациях. В остальных случаях рекомендуется явно указывать тип для повышения читаемости кода.

### 2. Преобразование типов

Иногда бывает необходимо преобразовать значение из одного типа в другой. В C# существуют:
- **Неявное преобразование** — автоматическое преобразование компилятором, если нет риска потери данных (например, int -> long).
- **Явное преобразование** — используется при возможности потери данных. Для этого применяются операторы приведения (например, `(int)` или методы, такие как `Convert.ToInt32`).

Примеры:
```csharp
// Неявное преобразование
int smallNumber = 42;
double largeNumber = smallNumber; // int -> double

// Явное преобразование
double someValue = 9.7;
int roundedValue = (int)someValue; // double -> int (теряется дробная часть)
```

### 3. Частые ошибки с типами данных

Ошибка при указании типа данных — одна из самых частых у начинающих программистов. Неправильный выбор типа может вызвать ошибки компиляции или неожиданные результаты.

## Практическая работа

### Задача 1: Исправление типов данных

Ваша задача — исправить код Васи, начинающего программиста. Вася в замешательстве и указал типы данных неверно. Замените многоточия на правильные типы данных и не используйте `var`.

Программа:

```csharp
public static void Main()
{
    double num1 = +5.5e-2;
    float num2 = 7.8f;
    int num3 = 0;
    long num4 = 2000000000000L;
    Console.WriteLine(num1);
    Console.WriteLine(num2);
    Console.WriteLine(num3);
    Console.WriteLine(num4);
}
```

### Задача 2: Исправление ошибки при работе с числами

Программа должна прибавить к числу 5 половинку (0.5), чтобы получить 5.5. Однако она не работает. Найдите и исправьте ошибку в первой строке кода.

Программа:

```csharp
static public void Main()
{
    double a = 5; // ← исправьте эту строку
    a += 0.5;
    Console.WriteLine(a);
}
```

## Домашнее задание

### 1. Конвертация типов

Напишите программу, которая:
- Запрашивает у пользователя два числа (целое и вещественное).
- Преобразует целое число в тип `double` и вещественное число в тип `int`.
- Выводит результат конвертации на экран.

### 2. Использование ключевого слова `var`

Создайте программу, которая:
- Использует `var` для объявления нескольких переменных с разными значениями (целое число, текст, число с плавающей точкой).
- Выводит тип каждой переменной на экран с помощью `GetType()`, чтобы показать, как компилятор автоматически определяет тип.

### 3. Исправление типов (практика)

Дана программа с ошибками типов. Исправьте её, указав корректные типы данных.

Программа:

```csharp
public static void Main()
{
    var price = "100";
    var discount = 10.5;
    var quantity = "5";
    
    double total = (double)price * quantity - discount; // Ошибка
    Console.WriteLine("Итоговая цена: " + total);
}
```

Подсказка: Исправьте объявление переменных и используйте преобразования для корректного выполнения операции.

